{
  "Aeriform": "(AeriformMAT.com) Dan Perez TeJada’s system of understanding, learning, and teaching. This is the basis for many concepts widely used within the Tricking community however it does vary from some of the more mainstream naming conventions. ",

  "Anatomy of a trick": "a way to break a Trick down into its constituent parts and a framework for building new unique tricks. Contains Takeoff Stance, Takeoff Style, CoreTrick, Landing Style, Landing Stance and Variations. It breaks a trick down into 5 parts Entrance, Beginning, Middle, End, and Exit. ",

  "Ambi": "Short for ambidextrous. This generally refers to the ability to perform a given trick on both sides, but can also mean the ability to do a trick on the opposite side, See Darkside. ",

  "BackFlip": "a somersault performed in the air in the backward direction",

  "Backswing": "takeoff in which the performer’s leg travels from back to front in a pendulum motion, similarly to kicking a ball with an exaggerated follow through. This is typically used to initiate back flipping motions such as gainers and corkscrews.  Often just labeled Swing.",

  "Backside (Stance)": " a stance in which the performer’s DOM is going directly behind them with the target at 90 degrees from there DOM in their default direction of rotation. Hips will be perpendicular. Left Twisters put the target to the Left, Right Twisters put the target to the Right. See Visual Glossary for further clarification.",

  "Backside Complete (Sub-Stance)": "a stance in which the performer is in Backside with their Complete leg touching the ground. Left for Left Twisters, Right for Right Twisters. ",

  "Backside Hyper (Sub-Stance)": " a stance in which the performer is in Backside with their Hyper Leg touching the ground. Right for Left Twisters. Left for Right Twisters. ",

  "Beginning": "the initiating phase of the coretrick, happens after the Entrance and is when the movements that begin to define the Trick are made. ",

  "Blocking": "a term used to describe the transfer of linear momentum into a vertical lift. In many cases, the mission of the block is to translate all of the lateral momentum into lift, maintaining the energy but directing it upwards to use for height in inversion moves, or alternatively converting it into vertical rotation for vert kicking moves.",

  "Boxcutter": "corkscrew hyperhook, a corkscrew that is over-rotated and lands in Hyper stance while executing an outside kick (hook) with the alternate leg.  ",

  "Boneless": "a variation on a vanish transition. Most often seen when transitioning from a hyper landing into a cork without changing the line of momentum. Boneless can be thought of as half a swing (specifically the last half starting from in front of the plant leg).  ",

  "Bound": " any unified transition that contains an additional stance adjustment step before taking off again. This adjustment step or hop can be used to change the stance we are in. See Unified Transitions",

  "Butterfly Kick": "a move with wushu origins, the bkick is similar to an aerial but performed on the horizontal axis with added flat spin. A bkick is dipped into with the chest and an arc is created with the jumping feet switching in air. ",

  "Butterfly Twist": "similar to an aerial twist but with a different flipping axis and added flatspin. A variation of a butterfly kick performed with an additional 360 degree rotation performed during the middle of the trick",

  "Carrythrough": "any swingthrough that has an additional stance change on the ground. either from Complete - Mega, Mega - Complete, or Hyper - Semi, Semi - Hyper.  ",

  "Cart": "a term referring to two hands touching the ground during the middle of a trick in a sequential, L>R or R>L, pattern. Taken from the cartwheel this hand-touch variation can be applied to any invert trick.",

  "Cartwheel": "an inside or outside flip performed where the hands touch sequentially in the middle. The performer in effect does a wheel with their body. Bringing their hands to the floor one at a time as the body inverts. The legs travel over the body while one or both hands are on the ground, and then the feet return to the floor one at a time. ",

  "Chamber": "the preparatory act within a kick done with the leg before executing the kick, this form of pseudo kick generally results in a knee bent shape pointing towards the intended target. ",

  "Cheat": "Takeoff method where the Tricker performs vanish into a wrap for a stance change. Typically from Frontside to Backside during the Takeoff of the Trick although it can be performed from Backside to Frontside. Rotation in Cheat Tricks will include the 180 degree rotation with the rotation measured from Backside. ",

  "Corkscrew": " an off axis gainer full. Performed from Backside - Complete using a BackSwing transition, the performer swings their leg across their body while swinging their arms up to generate a flip and spin. The cork often incorporates some Flatspin in order to avoid a true head over heels inversion.",

  "Combo": "linked series of Tricks, completed in succession, these utilize the landing stances, as well as transitions between the Tricks. See Anatomy of a Combo in the Visual Glossary for further clarification.",

  "CoreTrick": "a set of movements that meets the criteria to have its own name. Can be the most basic version of a Trick or a more complicated variation of one. Think of this as the move we are trying to isolate when looking at the anatomy of a trick.",

  "Complete (Stance)": "this is the standard landing position for Backswings, and ultimately contains two sub-stances within it. Backside - Complete. Which is your standard complete that is meant when Complete is said. There is also Outside - Complete. Which is where Lotus is swung from. Complete is often implied by simply stating the number of full twists performed. i.e. single, double, triple etc. ",

  "Cutter": " a nod to the boxcutter, this suffix is generally used on inverted axis tricks in places of the specification Hyper-Hook and can be considered slang.",

  "Crescent Kick": "a kick performed in a large wheel motion across the target in its direction of travel. See Inside Crescent Kick, and Outside Crescent Kick.",

  "Crowd Awakener (CA)": "sidesplit, or straddled variation in which two inverted round kicks are performed. In practice however most circumstances where a wide straddle is achieved will still bare the name, regardless of actual kicks performed.",

  "Dark-side": " the opposite side, or doing a trick with the opposite direction of spin from default. It is somewhat uncommon for trickers to utilize both sides, or directions of spin and when they do it is often designated by this tag Dark-side. i.e. Dark-side Gainer, Dark-side Cork. Etc. ",

  "Double Leg": "both a unique Trick as well as a variation. The Trick is modeled after the armada dupla from Capoeira. Taking off from two feet jumping into a pike position while rotating  Often described as a gymnastics “pike” position on the last half of a twisting move.",

  "Double (kicking)": "This variation is most often associated with any kick followed by 360 degrees of rotation (Hyper + Half Gyro) and another of the same kick. Another more rare variation has two fo the same kick on a target with no rotation performed between them. Technically anytime two kicks are delivered in aire it can be called a double, but there is usually a more appropriate suffic to use. In mainstream terminology, the name of the trick begins with the highest rotation and ends with the double suffix. For example: Pop-720-Double. ",

  "Double(twisting)": "any inverted trick with two rotations around the vertical axis (relative to the tricker’s local space) typically ending in the complete landing stance.",

  "Double (flipping)": "a flip in which there are two inversions performed where the head feet rotate around the center of the person flipping. Example: double-backflip, double-frontflip, double-sideflip",

  "Dub": "a slang term for inverted double twists of any kind when said stand alone it infers a double full, although it will often be used along with other notifiers such as DubCork, DubBack, DubB (double ButterflyTwist)",

  "Eagle": "slang term for the starting position for a backswing. Charachterized by the swing leg and arms positioned behind the body preparing for the execution of a backswing trick. ",

  "End(anatomy of a trick)": "After the majority of criteria of the Trick has been met but there is still some inversion, or rotation needed to complete the movement in air.",

  "Entrance(anatomy of a trick)": "the entrance is the start of the Trick before any determining movement has been performed, this is where you will find the Takeoff Stance and Takeoff Style. ",

  "Envergado": "a fully inverted parafuso. Another way to look at this trick is as an inverted raiz into a double leg. The “enver” prefix can be used to note an envergado fulled by a variation suffix, such as enver-snapu, an envergado followed by a fulltwist in the exit of the trick. ",

  "Exit(anatomy of a trick)": "after all criteria for the Trick has been met and the only thing left is completing the Landing Stance and Style for the next Transition ",

  "Flip": "referring to the inversion of a trick, usually to describe some aspect of the somersault being performed.",

  "Flipping": "referring to the elements of tricking that contain inversions, typically starting and ending on the feet. ",

  "FrontFlip": "a somersault performed in the air in the forward direction",

  "Fei Long": "an in-air kicking combination in which an outside kick is followed by 180 degrees of rotation and an inside kick to the same target. Typically performed with crescent kicks as they allow the hips to stay open and more easily execute both kicks. This is both a specific vert kick as well as a variation type used by both the vertical and inverted axis.",

  "Fei Long Cross": "a variation of the Fei Long in which a hook and round are used. ",

  "Feint": "faked kick, essentially the kick stops being performed in chamber and is never extended.",

  "Flamingo": "similar to the Eagle but in reverse. The flamingo is the starting position for a frontswing and is charachterized by the swinging leg extended in front of the body and the arms raised up, preparing for the execution of a frontswing Trick",

  "Gainer": "a backflip performed from one leg, typically swung into. This term is often used to refer casually to both the gainer-flash kick, as well as the gainer switch, using context from the combo to infer which is meant. The gainer prefix can also be used to note a swing takeoff into an inverted trick. i.e. gainer-arabian, gainer-full etc… unlike many other acrobatics, the tricking gainer does not require forward motion.",

  "Grab": "similar to many board/wheel sports, it is simply the act of grabbing a part of the body, typically the leg or foot/feet with the hand. This type of variation is still relatively unexplored. ",

  "GrandMaster (GM)": "a swing takeoff where the performers outside leg swings inwards and initiates an inside flip where the hands do not touch the ground. For example, a masterswipe without landing on the hands becomes a grandmasterswipe. Often used as its abbreivation for prefixing. i.e. GMS for grandmaster swipe, GMT for grandmaster twist, GMSnapu for grandmaster snapu",

  "Gyro": "denotes an additional spin performed in the exit of a Trick, most often after a kick or kicking variation. Gyro typically refefers to the vertical axis, and implies that the extra rotation occurs with the performer upright. ",

  "Hawkeye": "a variation of a round kick, can be thought of as a round kick where the execution of the kick on target is replaced with that of a hook kick. A round kick start, hook kick middle, round kick finish. A hawkeye can be performed as a variation anywhere you would typically execute a round kick.",

  "Hook Kick": "traditional martial arts hook kick. There are many ways to perform this kick when it comes to specific form. Typically it is a kick which executed at or above waist height where the heel of the foot leads across the Target in its Direction of Movement. The kick is Chambered, extended outwards across the Target, which has been spotted and then re-chambered during which the planted foot may pivot to maintain balance. ",

  "Hyper (deprecated)": "In the past (before the landing stances had been established) Hyper was used to note the over-rotation of a trick, and landing on the opposite foot. While this understanding is still used it is widely understood that a more specific meaning is meant. Typically referring to a landing stance, or a kicking variation. ",

  "Hyper (stance)": "a landing position on the invert axis where the performer rotates past the complete position, and lands on their inside kicking leg, with the performers momentum is pulling backwards or toward their inside flipping shoulder, this position typically allows the performer to wrapthrough, or swingthrough into GMswings. ",

  "Hyper (vert kicking)": "in the context of vert kicking, hyper simply means to landing on the kicking leg. In the TKT system, this term is specifically a 180 degree rotation after a kick, landing on both feet simultaneously. Largely replaced with the term Turbo to refer to the two-footed laning. This term can also be, and often is, used as a blanket term that covers Hyper(vert kicking), Hyper-Style, True-Hyper.",

  "Hyper-Hook(trick)": "refers specifically to a B-Twist Hyper Hook. Where the butterfly twist is over rotated to the hyper landing stance and an outside kick (hook) is performed. ",

  "Hyper-Hook (variation)": "a variation used on the invert axis, this suffix signifies that the trick was landed in the hyper stance while performing an outside kick (hook) during the exit of the kick. ",

  "Hyper-Style (vert kicking)": "a landing variation in which 180 degrees of rotation is performed after a vertical, but the original landing leg (non-kicking) is still used. This term is primarily used within TKT, and rarely used in mainstream terminology.",

  "Illusion Kick": "Similar to an aerial that has an added axe kicking motion from the takeoff leg. It is a 0 rotation illusion twist. Similar to how a Butterfly kick is a 0 rotation Butterfly Twist",

  "Illusion Twist": "Similar to a btwist, an illusion twist takes off from a butterfly kick/twist style dip into the takeoff where a pop3 is than performed. This typically lands in a frontside stance. ",

  "Inside Crescent Kick": "Similar to the round kick, but generally done with a straight leg. The key difference is that the foot stays in a vertical position throughtout this kick, and strikes with the inside edge of the foot. ",

  "Inside Flip": "the inside flip is a sideflip toward the direction of the performers twists and is performed from any of the inside stances such as Hyper, Mega or Inside. The inside flip is considered the base flip for the Tak axis, as well as GMswing tricks. ",

  "Inside Kick": "generic term referring to either a round, or an inside crescent kick. Performed by whichever leg will execute a strike while traveling to the inside of the person performing it. ",

  "Inside (Stance)": "stance between frontside and backside where the performers hips are squarely facing the “Target”. Also often referred to as “neutral stance”. Many people begin their backside tricks from this position. ",

  "Invert": "The act of flipping within a trick. In order to be a true inverted trick, the hips must reach a point higher than the performers head during the trick. However, in general tricks reaching approximately horizontal orientation (180 degrees), or where the hips are level with the performers head are considered to be Inverted tricks. ",

  "JackKnife": "an in air kicking combination in which an inside kick is followed by 180 degrees of rotation and an outside kick to the same target. This is typically performed with a round kick followed by a hook kick on the same target. The use of round kick encourages the hips to turn over allowing the hook to come out more naturally as opposed to the body positioning when using inside and outside crescents. ",

  "J Step": "a common setup used for swing tricks. The performer steps forward with a variable amount of steps, typically two, but could be many.  The final step is always performed with the outside leg, often referred to as the plant leg, the foot is turned 90 degrees outward and the trailing leg is swung through. The turn creates a J pattern on the ground and allows for blocking to generate lift in the swing trick being executed. This patter also allows the hips to be square increasing the ease of movement and power able to be generated from the swing. ",

  "Kata": "Japanese word meaning “form”. These forms typically refer to a series of choreographed Martial Arts movements designed to be practiced alone or in sync with others. They are used as a way to demonstrate, as well as cultivate, the practitioners mastery of skills. Kata refers to a specific “way of doing” with emphasis on the form and order of the process. In other words a deeply focused, embodied practice. ",

  "Knife (variation)": "this suffix is added to both invert tricks as well as vert kicks. In vert kicking it implies either a hypered inside kick or swipe was performed at some point during the trick followed by a hook kick while landing. In invert trick it implies that a trick will be landing in hyper landing stance while performing an outside kick (hook) ",

  "Kyro (variation)": "any hyper-hook variated trick followed by an additional twist or gyro. For example a cork kyro is a boxcutter followed by an additional 360 degree rotation after the hyper hook has been performed. This typically means a majority of this last rotation is performed during the exit of the trick in a semi upright position. ",

  "K-Step": "a term generally used to describe a variation of the cheat takeoff where a double pivot is used. The K-step chooses to move forward into the trick generating a lot of blocking for lift. This form of cheat takeoff is very popular among the Korean Trickers and as such was named the K-Step, short for Korean Step.",

  "Landing Stance": "The position in which a trick terminates. For both vertical kicks and invert tricks there are a multitude of possible positions, each carrying their own transitional possibilities. There are BIFO:  Backside, Inside, Frontside, Outside and CHMS: Complete, Hyper, Mega, and Semi. These BIFO and CHMS landing stances overlap with each other and create all of the possible landing stances. Backside Inside Outside and Frontside refer mainly to how square your hips are to the target and which direction. Complete Hyper Mega and Semi give context to which direction is being traveled and specifies how the feet are landing. Complete(backwards) and Mega(forwards) referring to the outside leg touching the ground. Hyper (backwards) and Semi (forwards) referring to the inside leg touching the ground. See graphics for further disambiguation ",

  "Late-": "sometimes followed by a number such as late-9 or late 10 implying a kick type( round or hook) referring to the bs900 (round) or bs1080 (hook) in mainstream terminology. Although many people have begun using late-round and late-hook to make the differentiation. A late kick is characterized by the trick being primarily completed but an over-rotation performed while executing a kick. This is different from the hyper-hook variation in that the kick is executed after the foot has landed as opposed to beginning in the air. ",

  "Mainstream (Terminology)": "the most common language and set of terms used by trickers. Many of the names date back to the originis of tricking and sport karate circuits of the 1990s. Mainstream terminology is more or less an oral tradition. Many definitions and concepts can be deduced from common usage within the community at large and older Tricking websites but there is no central location or formal standardization. It is a loose system with varying perspectives and opinions that change from community to community as well as individual to individual. However when viewed as a whole mainstream terminology can thought of as the common dialect that almost all trickers can communicate with. ",

  "MasterSwipe": "a GMswing trick where the performers hands touch the ground. The difference between the master and the grandmaster is whether or not the performers hands touch during the trick. In a master trick the performer will touch with both hands in the middle of the trick while the grandmaster tricks will be performed completely in the air. ",

  "Master": "a term reffering to two hands touching the ground during the middle of a trick. This is inbetween a sequential hand placement of a cart and the unified hand placement of a spring.",

  "Mega (stance)": "landing position on the invert axis where the performer rotates past the hyper position and lands on the outside kicking leg, with their momentum pulling them forward or toward their inside flipping shoulder. This stance is 180 degrees past the complete landing stance and can often be looked at as a half rotation added to the core-trick. Mega landings allow the performer to perform front swings such as aerial and btwist axis tricks.",

  "Mega-Round": "Similar to a hyper-hook. A mega-round is a suffix used to describe landing in the mega landing stance while performing a round kick. Commonly referred to as late-round See Late-",

  "Missleg": "singular transition in which the in-air leg rebounds into the next trick. It could be said that the leg literally misses the ground and changes its path to create a new takeoff. Often used where a sequential takeoff is typically utilized where the leading leg is intentionally misses the ground and moves into a boneless swing. See Boneless; Swing(takeoff)",

  "Middle (anatomy of a trick)": "the main part of the Trick where most of the movement is performed, this is where the most common variations will typically take place, although any part of the anatomy of the trick may contain a variation. ",

  "Momentum Line": "the imaginary line created  by a tricker as they travel throughout a combo. The momentum line is generally perpendicular to the target both in theory as well as practice. See DOM",

  "Murder (grab)": "a variation of a swing through transition in which the swinging leg was grabbed in the previous trick, and held throughout the transition. For example when doing a cork-rodeo, landing while maintaining the rodeo-grab and swinging the grabbed foot into another cork, the second cork would receive the name Murder-Cork.",

  "Muggle": "a somewhat controversial term within the community. Many tend to think that it implies a derogatory meaning towards those people who do not Trick. While it has been used by some in that way the original meaning was an homage to the world of Harry Potter in which the muggles were those individuals who did not know about the Magic world that they existed along side. Early usage of the term often referred to those people who had not been opened up to the magic of Tricking and expanded to imply someone who had not been opened up to the magic of LIFE. The magic in this case being amazing potentials and exciting possibilities that are beyond the view of the everyday person stuck in the rat race. ",

  "NASKA": "The North American Sports Karate Association. Naska is one of the oldest, and most prestigious sport karate leagues. It served as the birth place for many of the tricks commonly found within Tricking today, as well as bringing together many of the early practitioners that led its growth over the years.",

  "Neutral (stance)": "typically used when discussing vert kicking setups. Neutral refers to either Inside when talking about Backside Kicks or Outside when talking about Frontside Tricks. Neutral is a contextual term that switches its meaning and can be confusing to some. ",

  "OC": "an original combo. A slang term used to note a combo that has a particular high degree of originality, creativity, and/or technicality. OC began to be thrown around in response to the CookieCutter Combos that were often performed by many trickers. People became tired of seeing Ch9->Hook->TDR->Cork-> (swing chain) and would encourage people to do more OC’s meaning, do something we haven’t already seen a million times.",

  "Outside Crescent Kick": "similar to a hook kick, but generally done with a straight leg. The main difference is that the foot stays in a vertical position, with the toes facing up, throughout this kick. It strikes across the target with the outside edge of the foot.",

  "Outside Flip": "the outside flip is a sideflip in the opposite direction of the performers twists and is performed from any of the outside stances such as Complete, Semi, or Outside. The outside flip is considered the base flip for the raiz and lotus axis tricks.",

  "Outside Kick": "generic term referring to either a hook, or outside crescent kick. Performed by whichever leg will execute a strike while traveling to the outside of the person performing it.",

  "Outside Stance": "stance between backside and frontside where the performers hips face away from the target. It is very common to see trickers adopt this as the starting point for frontside tricks and is commonly referred to as “neutral”.",

  "Parafuso": "similar to a double leg. The parafuso can be described as a cheat takeoff into a double leg where the legs come together on the target. Typically the performer executes an outside crescent kick to the target, while holding the outside kick on target they perform an inside crescent kick to match it on target, the kicks then continue in a double leg fashion for completion. It is important to note the back stays primarily upright in this trick and the hips remain below the head at all times. This is the main differentiation from the double leg. It is not uncommon to see “para” used as a prefix to describe any double leg variation on both the vertical and invert axes which is generally understood and accepted interchangeably.",

  "Peter Pan": "a shape variation, or body position taken during a trick in which the performer places both fists on their hips, with their elbows out wide, similar to the stance taken by Peter Pan in the animated Disney movie.",

  "Pizzaboy": "a variation similar to a scissor or helicoptero. Pizzaboys have been described as a flashkick swing tornado kick in the air before landing. The pizzaboy completes the flashkick or swipe before transitioning to the tornado, and can be added to any move with a swipe or flashkick motion. Another way to descibe it is by saying that it is a swipe or flash followed by a late-round (mega-round).",

  "Pop": "a transition where a sequential landing is followed by a unified take off. Or more simply put it lands one foot then the second and takes off with both feet simultaneously into the next trick. This method of takeoff where the performer steps or hops into a jump with both feet simultaneously is commonly used in both invert tricks as well as vert kicks.",

  "Pump": "term used to describe the lifting of the knee, as if chambering, durring the rotation of vert kicks. This usually means the non-kicking leg will be pumped prior to extending the kick with the opposite leg, and can be used to generate height, rotation, and hip positioning for the kick. ",

  "Punch": "a transition where a unified landing immediately rebounds into a unified takeoff. For most trickers this looks like a powerful stomp into the ground using the floors rebound to generate power and height in the next trick",

  "Pure Setups": "a pure setup is the initial movements used to generate momentum and put the body in position to begin the first Trick of a combo. These include J-Step, K-Step, Euro-Step, Pivot, Spin Step, Skip Step, as well as Standing.",

  "Rapid": "a transition similar to the misleg, can be described as a one-legged punch. ",

  "Rechamber": "the act of returning the kicking leg back to the Chambered position after the kick has been performed. This allows for greater control during landing as it brings the performers center of gravity back under them.",

  "Recycle": "slang term for a master swing performed typically from a hook kick into a vert kick. This allows swings into backside without additional rotation or pivot needed. ",

  "(Skip Reversal)Redirect": "another form a reversal transition. Redirect transitions lands sequentially, followed by an adjustment step, and takes off in the reverse sequence from its landings. L-R-Adjustment-R-L",

  "Reversal": "sequential transition where the sequence of landing and takeoff are reversed. Lands L-R Takes off R-L or vice versa. ",

  "Reverse": "older term used to describe traveling backwrd into a trick, or a trick that doesnt usually have backward travel performed with it. ",

  "Reverse Pop": "a transition that that lands unified and takes off sequentially. This is the inverse of a Pop transition. It lands with two feet together and takes off one then the other. ",

  "Rocket Boy": "a variation where the performer reaches down while in a piked, or double leg, position and grabs the opposite ankle with their hand while the other arm reaches high above the head during an inverted trick. ",

  "Rodeo": "a variation whre the performer reaches back and grabs their ankle. This is generally accompanied by pushing forward with the hips and arching the back to further emphasize the position. Grab can be performed with one arm or both simultaneously.",

  "Round Kick": "traditional martial arts roundhouse kick. There are many ways to perform this trick but the general guideline is that the foot is turned horizontally upon striking its target and is typically performed with the inside kicking leg. The contact point traditionally is the ball of the foot, or when toes are pointed can anywhere from the top of the foot to the base of the shin. More simply put a kick performed at or above waist height in which the toes of the foot leads across the target in its direction of travel.",

  "-Round": "a variation where a complete rotation is completed on the invert axis followed by a round kick. For example a cork ending with a round kick in complete landing stance would be called a Cork-Round.",

  "Safari": "a variation similar to the Rocket Boy but utilizing a shuriken, instead of the pike, or double leg position. The arm opposite of the kicking leg will make the grab to create the proper position. Put another way a safari is a type of cross body grab when performing a shuriken in an invert trick. ",

  "Scissor": "a variation where the performer performs a twist kick in the place of a traditional -round variation. So a cork-round performed with a twist kick becomes a cork-scissor. In order to get the hip position for the kick to come out many cork-scissors land in mega. Can also be used as slang term for a scissor-swipe. ",

  "Scissor-swipe": "a variation on the martial arts scissor kick in which an outside kick or side kick is performed simultaneously with an inverted roudn kick, or twist kick with the other leg. This variation is most often applied to invert tricks. Within the tricking community the only emphasis is on the twist kick, or inverted round. Many people have opted to drop the swipe as it does not have a tricking “swipe” in it and refer to this simply as scissor. ",

  "Setup": "a movement used to generate momentum and get into the starting position for a particular Trick. This generally refers to pure setups however it can sometimes be used to include Setup Tricks or even Setup Combos. See Pure Setups; Setup Tricks; Setup Combos; for further detail. ",

  "Setup Tricks": "a trick performed to generate momentum to be used in a larger trick or combo. This is typically things like Cartwheel, Roundoff, Aerial, Gumbi, Raiz, Touchdown Raiz, Backhandspring, Macaco, Scoot, Masterscoot, or even a Hook kick. However any trick that generates momentum can be used. Even more difficult ones such as Btwist, Cork, or DoubleCork. Can also be used to refer to what tricks you can do before a particular movement, such as cork, double cork, btwist etc. ",

  "Setup Combos": "a series of Tricks performed to generate momentum to be used in a larger Trick or combo. People will often refer to their Dub-Dub Setups meaning what tricks they have combo’d into Dub-Dub. Or put another way what combos they are able to perform Dub-Dub out of. ",

  "Semi (stance)": "landing position on the invert axis where the performer rotates past the mega postion and lands on the inside kicking leg, with their momentum pulling forward or toward their outside flipping shoulder. This stance is 180 degrees past hyper position and can be looked at as a half rotation added to the core trick. Semi landings allow the performer to swingthrough into frontswings, raiz, and spyder axis tricks.",

  "Sequential": "this term describes a landing or takeoff style where the feet land one at a time. When used to describe transitions it typically means that both the landing and takeoff styles occur sequentially. ",

  "Shuriken(variation)": "a variation type on the invert axis whre an outside kick is performed while twisting, followed by landing on the kicking leg in the complete stance. In higher rotations further twisting can be performed after the kick and still be labled shuriken.",

  "Single (twisting)": "any inverted trick with the performer executing a full rotation around their vertical axis into the complete landing stance.",

  "Singular": "this term describes a landing or takeoff style where only one foot lands during the transition. ",

  "Skip": "another form of a vanish transition. Skip lands sequentially, followed by an adjustment step, and takes off in the same sequence as its landing. L-R-Adjustment-L-R",

  "Snapu(trick)": "short for snapuswipe. This trick is essentially an inverted 540 Gyro. Or another way to picture it is a sideswipe full twist. The performer executes a vanish into a swipe and then rotates an additional 360 degrees to land on their feet.",

  "Snapu(variation)": "a variation where any swipe is followed by a full twist. For example a cork swipe fulltwist is a cork snapu",

  "Somersault": "an acrobatic movement in which a person turns head over heels in the air or on the ground and lands or finishes on their feet ",

  "Spring": "a term referring to two hands touching the ground during the middle of a trick in a unified fashion. These are typically performed similar to a back or front handspring motion but can be applied to all invert tricks. ",

  "Squirrel": "very similar to a rodeo Grab, the main difference is the performer reaches for and maybe touches, but never actually grabs their foot/ankle. See Rodeo",

  "Stepover (takeoff)": "similar to a swing the inside kicking leg is lifted while pivoting up to 180 degrees in the direction of typical rotation however in the stepover the swing takes the chambered position and the performer then “steps over” their chamber while still in the air.  ",

  "Swing (takeoff:kicks)": "method of takeoff where the performer lifts their inside kicking leg while pivoting up to 180 degrees in the direction of their typical rotation.",

  "Swing (takeoff:inverts)": "method of takeoff where the performer uses their inside kicking leg to generate power and inversion to begin an invert trick. See Backswing and Frontswing",

  "Swing (transition)": "singular transition in which the in-air leg travels in a parabolic arc underneath the performer uninterrupted and is used to generate power and lift for the next trick. ",

  "Swipe": "an inside kick that lands on the kicking leg where the hips reach mostly horizontal or more inversion. Trickers typically target high in the air above them for this trick in order to generate inversion.",

  "Swipe-Knife(trick)": "a swipe hyper-hook. Similar to a jackknife it replaces the inside round kick with a swipe. The performer will vanish into a swipe performing a hook while landing on the initial kicking leg.",

  "Swipe-Knife(variation)": "a compound variation. The Swipe-Knife suffix is reserved for inverted tricks as the swipe implies some level of inversion. It is very similar to a jackknife, although it uses a swipe in place of the inside kick. ",

  "Tak": "short for Takuraba, a wrap takeoff into a frontflip.",

  "TakFull": "one of the most common variations of the takuraba, a takfull takes off from the hyper stance and wraps into an inverted full twist back to a complete stance.",

  "Tak9": "TakFull-Round, a variation of the TakFull where an inside kick, typically a round is performed during the landing.",

  "TKT (True Kick Terminology)": "a systematized approach to the study of tricking, founded by Dan Perez DeTejada. This system is widely known for naming kicks by their true rotational value. TKT is often congruent with the Aeriform Martial Arts Tricking system which is known for its systemized breakdown of many parts of tricking, from takeoffs to landings, to transitional definitions and beyond.",

  "Tornado (kick)": "one of the most basic kicks, and often one of the first tricks people learn. A tornado kick is a cheat takeoff followed by 180 degrees of in-air rotation and an inside kick (typically a round) is performed on target. In TKT this is written as cheat360round, the extra 180 degrees coming from the on-ground rotation in the cheat setup.",

  "Transition": "movement performed in between Tricks that allows them to be linked, can be used to reposition for the next intended Trick, or generate power. Transitions are broken into several categories based on the general sequence of landing one trick and taking off into the next. Its categories include Singular, Unified, and Sequential.",

  "Triple (kicking)": "this is most often associated with three consecutive, alternating kicks to the target while spinning. Technically speaking anytime three kicks are performed in-air it can be considered a triple, however there is typically a more accurate term to use in these cases. See Hurricane.",

  "Triple (twisting)": "any inverted trick with three twists around the performers vertical axis landing in a complete stance. ",

  "True-Hyper (vert kicking)": "a landing in which 180 degrees of rotation is performed after a vertical kick that lands on the kicking leg. This term is used almost exclusively within the TKT community, and is implied by the generic term Hyper among most mainstream terminology users.",

  "Turbo (vert kicking)": "a two footed landing variation. This term has taken over the mainstream terminology to replace Hyper (TKT) when refering to kicks that have a variated landing. ",

  "Trick": "a set of movements, typically acrobatic in nature, performed that can be referred to by a name that differentiates itself from other movements.",

  "Twisting": "the elements of tricking related to the rotational aspect of the acrobatic movements being performed",

  "Twist": "referring to the rotation around the vertical axis local to the performer. Think of this as rotating around an imaginary line through the center of your body. Another way to describe it is as a spin around the body’s center during an inverted trick.",

  "Unified": "this term describes any landing or takeoff styles that utilize both feet simultaneously. When used to describe a transitions it typically means that the takeoff is unified.",

  "Vanish": "sequential transition in which the landing and takeoff folllow the same sequence. Landing L-R Taking off L-R. Or vice versa.",

  "Variation": "performing any trick in a way that deviates form its base skill. This often means the addition of a kick, grab, rotation, or body shape, or could mean an adjustment to the Transition, Flip, DOM, or setup.",

  "Vert Kick(kicking)": "kick delivered with no major degree of inversion. The performer stays relatively upright throughout the execution of the trick.",

  "WackKnife(trick)": "variation on the jackknife where the rotation between the first and second kicks has been removed. Upon executing an inside kick on target the performer re-chambers the inside leg while simultaneously chambering and executing an outside kick to the same target. This is almost always accomplished utilizing inside and outside crescent kicks which allow the hips to stay open and fixed toward the target while the legs are in motion. ",

  "WackKnife (variation)": "a variation that can be used with vert or invert tricks. see WackKnife(trick)",

  "Windex": "slang term for a raiz hyper-hook. Commonly understood as a swipeknife without the swipe. ",

  "Wrap": "a type of transition that generally refers to an onground adjustment pivot from one stance into another during takeoff. This could be from Hyper>Semi; Semi>Hyper; Complete>Mega; Mega>Complete",

  "Wrap(kicks)": " when used in vert kicking the wrap generally refers to a trick whose cheat is over-rotated past what is generally accepted for cheat takeoffs.",

  "Wrap(invert)": "when used in invert tricks the wrap generally refers to as a hyper landing stance where the performer pivots into either a frontside hyper, or a semi takeoff stance for a front swing into the trick. Most common is wrap-full, all Tak based tricks utilize this in their takeoff. ",

  "X-Out(variation:shape)": "variation in which the body is positioned with both legs kicked out into a straddle position in-air. This variation sometimes uses the arms as well to create a true X shape with the body although the straddled legs generally meet the criteria when referring to invert tricks."
}
